# Importing & FIltering Data

### Import Basic Packages

In [1]:
#Basics
import numpy as np
import pandas as pd

### Import Data from CSV

In this scenario we'll import a dataset of students enrolled in a school and explore ways to select and filter data of interest.

In [3]:
# Import CSV data to a pandas dataframe
df_csv = pd.read_csv('../data/student grades.csv')

### Import Data from Excel File

**pd.read_excel function**

- Default is to import first sheet of an Excel file. **sheet_name** argument defines which sheet the data should come from 
- **usecols** arugment defines which columns to import

In addition, there are many other arguments that can be defined to specify how the file should be interpreted.

Documentation here: https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html

In [2]:
# Import data to a pandas dataframe
df_xlsx = pd.read_excel('../data/student grades.xlsx', sheet_name='student_grades')

### Selecting Columns

We have several options to filter the data coming into our analysis.

Options:
- Option 1 (SQL): Select the required columns as part of our SQL SELECT statement.
- Option 2 (Python): Select the desired columns only from the dataframe in Python.
- Option 3 (Python): Drop the NOT required columns from the dataframe.

In [16]:
# Use Option 2 above to create a new dataframe
# Keep only the student_ID and grades columns
df_cleaned = df_xlsx.drop(['student_ID', 'grade_avg'], axis=1)
df_cleaned.head()

  first_name last_name      faculty  tuition  OH_participated  classes_skipped
0       John      Park         Arts    44191                0                5
1       Alex     Great      Science    32245                4               10
2  Sebastian    Taylor     Business    42679                6                7
3    Michael       Bay         Math    46478               15                2
4      Scott    Foster  Engineering    36784                5                8

In [ ]:
# Use Option 2 above to create a new dataframe from the 
# This time drop the student_ID and grades columns
df_xlsx.head()
df_drop = df_xlsx
df_drop.head()

   student_ID grade_avg
0    20123456         B
1    20123457         B
2    20123458         B
3    20123459         A
4    20123460         A

Filter Columns

We can use the `filter` function allows us to select columns based on the criteria we want. 

This is a very powerful way of filtering for columns, as we can systematically call for columns that meet a specific condition without having to check manually what kind of columns we have in our dataframe.

In [7]:
# Using the filter function with regex parameters to find a column that contains a specific word
df_filter = df_xlsx.filter(regex='name', axis=1)
df_filter.head()

  first_name last_name
0       John      Park
1       Alex     Great
2  Sebastian    Taylor
3    Michael       Bay
4      Scott    Foster

### Filtering Rows

We can also filter for rows that contain a certain string in a column using the `contains` function as well.

In [4]:
# Using the contains functions to find rows that contains a specific word in a column
df_contains = df_xlsx[df_xlsx['first_name'].str.contains('John')]
df_contains

,student_ID,first_name,last_name,grade_avg,faculty,tuition,OH_participated,classes_skipped
0,20123456,John,Park,B,Arts,44191,0,5
19,20123475,Johnson,Curry,B,Engineering,40539,9,3

We can also filter rows/columns based on logical conditions in the dataframe.

In [7]:
# Filter the rows of the original datframe to include only rows where GradeAverage is A
df_filter = df_xlsx[df_xlsx['grade_avg']=='A']
df_filter

,student_ID,first_name,last_name,grade_avg,faculty,tuition,OH_participated,classes_skipped
3,20123459,Michael,Bay,A,Math,46478,15,2
4,20123460,Scott,Foster,A,Engineering,36784,5,8
11,20123467,Megan,Botts,A,Science,34751,25,1
12,20123468,Cyrus,Wong,A,Science,49298,20,0
14,20123470,Zachary,Chua,A,Business,31210,10,0
20,20123476,Paul,Reed,A,Business,41397,14,2
21,20123477,Josh,Hart,A,Engineering,46468,4,8
22,20123478,Justin,Kang,A,Engineering,35859,2,9
23,20123479,Kevin,Yoo,A,Arts,41048,8,1
24,20123480,Rosaline,Jun,A,Arts,44915,25,3
26,20123482,Joseph,Kim,A,Math,33376,12,6
29,20123485,Shelly,Yoon,A,Math,33585,5,10

We can add additional conditions using the & symbol.

### Drop Duplicates

Generally duplicates are unwanted, although sometimes there is a clear reason why they exist. If we know that duplicates are incorrect, we can deal with them.

Lets say that we want to get rid of all duplicate last names. We can first filter for any duplicate last names in our data to see if they exist.

In [9]:
# Identify any rows with duplicated last names
df_duplicate = df_xlsx[df_xlsx['last_name'].duplicated()]
df_duplicate

,student_ID,first_name,last_name,grade_avg,faculty,tuition,OH_participated,classes_skipped
8,20123464,Marge,Simpson,B,Math,39429,10,3
25,20123481,Jimin,Park,B,Engineering,34570,20,3

We can see that with the combination of the duplicated function and filtering with it, we found the rows that have duplicated last names. We can now use the drop_duplicates function to easily remove these.

In [ ]:
#drop duplicates column
df_dropped_duplicates = df_xlsx.drop_duplicates(subset=['last_name'])
df_dropped_duplicates # dropped the rows with duplicate last_cols

,student_ID,first_name,last_name,grade_avg,faculty,tuition,OH_participated,classes_skipped
0,20123456,John,Park,B,Arts,44191,0,5
1,20123457,Alex,Great,B,Science,32245,4,10
2,20123458,Sebastian,Taylor,B,Business,42679,6,7
3,20123459,Michael,Bay,A,Math,46478,15,2
4,20123460,Scott,Foster,A,Engineering,36784,5,8
5,20123461,Amy,Winehouse,B,Arts,36537,10,3
6,20123462,Ralph,Wiggins,B,Business,40762,2,8
7,20123463,Homer,Simpson,C,Engineering,47669,4,7
9,20123465,Peter,Gryffin,D,Arts,31956,7,7
10,20123466,Louise,King,D,Business,33227,6,7
11,20123467,Megan,Botts,A,Science,34751,25,1
12,20123468,Cyrus,Wong,A,Science,49298,20,0
13,20123469,Michelle,Chang,B,Business,35046,5,4
14,20123470,Zachary,Chua,A,Business,31210,10,0
15,20123471,Angus,Helmsworth,B,Business,47515,10,1
16,20123472,Aaron,McDowell,B,Business,43421,13,2
17,20123473,Carol,Kuo,B,Engineering,43063,7,4
18,20123474,Tim,James,B,Science,46775,9,4
19,20123475,Johnson,Curry,B,Engineering,40539,9,3
20,20123476,Paul,Reed,A,Business,41397,14,2
21,20123477,Josh,Hart,A,Engineering,46468,4,8
22,20123478,Justin,Kang,A,Engineering,35859,2,9
23,20123479,Kevin,Yoo,A,Arts,41048,8,1
24,20123480,Rosaline,Jun,A,Arts,44915,25,3
26,20123482,Joseph,Kim,A,Math,33376,12,6
27,20123483,Chris,Dang,F,Business,44737,3,8
28,20123484,Robbie,Tee,B,Engineering,49682,10,6
29,20123485,Shelly,Yoon,A,Math,33585,5,10

### Exercise 1  - Importing our data

Import the csv file titled "phone_marketplace_dataset_cleaning_set.csv" and set it as a dataframe. This dataset contains information on used phone sales that happened in various marketplace platforms.

Task:
- Use the correct pandas function to import the csv file as a dataframe
- Assign the imported dataframe to a variable

In [1]:
# Import the phone_marketplace_dataset_cleaning_set.csv file into a dataframe

### Exercise 2  - Conditional Filtering

We realized that there may be potential errors in the csv file in which we must deal with. Luckily, we are able to find out the errors came from data which came from craigslist.

Task:
- Filter for data that have craigslist as a marketplace
- From the data that have craigslist as a marketplace, filter for only iPhone 11s

In [ ]:
# Filter the data that has craigstlist as marketplace

In [ ]:
# Add an additional filter for iphone 11 only.